[
    {
        "id": "01",
        "title": "Learn Ethical Hacking From Scratch",
        "category": "Ethical Hacking",
        "img": "https://images.pexels.com/photos/60504/security-protection-anti-virus-software-60504.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1 ",
        "price": 25000,
        "description": "Welcome this comprehensive Ethical Hacking course! This course assumes you have NO prior knowledge and by the end of it you'll be able to hack systems like black-hat hackers and secure them like security experts! This course is highly practical but it won't neglect the theory; we'll start with ethical hacking basics, breakdown the different penetration testing fields and install the needed software (on Windows, Linux and Mac OS X), then we'll dive and start hacking straight away. You'll learn everything by example, by analysing and exploiting different systems such as networks, servers, clients, websites .....etc. We'll never have any boring dry theoretical lectures.",
        "syllabus": "1. Network Hacking - This section will teach you how to test the security of both wired & wireless networks.  First, you will learn network basics, how they work, and how devices communicate with each other.  Then it will branch into three sub sections: Pre-connection ttacks:  in this subsection you'll learn a number of attacks that can be executed without connecting to the target network and without the need to know the network password; you'll learn how to gather  information about the networks around you, discover connected devices, and control connections deny/allow devices from connecting to networks).   Gaining Access: Now that you gathered information about the networks around you, in this subsection you will learn how to crack the key and  get the password to your target network whether it uses WEP, WPA or even WPA2. Post Connection attacks: Now that you have the key, you can  connect to the target network, in this subsection you will learn a number of powerful techniques that allow you to gather comprehensive  information about the connected devices, see anything they do on the internet (such as login information, passwords, visited urls, images,  videos ....etc), redirect requests, inject evil code in loaded pages and much more! All of these attacks work against both wireless and  wired networks. You will also learn how to create a fake WiFi network, attract users to connect to it and use all of the above techniques  against the connected clients. 2. Gaining Access - In this section you will learn two main approaches to gain full control or hack computer  systems:Server Side Attacks:  In this subsection you will learn how to gain full access to computer systems without user interaction. You  will learn how to gather useful information about a target computer system such as its operating system, open ports, installed services,  then use this information to discover weaknesses and vulnerabilities and exploit them to gain full control over the target. Finally you will  learn how to automatically scan servers for vulnerabilities and generate different types of reports with your discoveries.Client Side Attacks  - If the target system does not contain any weaknesses then the only way to hack it is by interacting with the users, in this subsection you'll learn how to get the target user to install a backdoor on their system without even realising, this is done by hijacking software updates or backdooring downloads on the fly. This subsection also teaches you how to use social engineering to hack secure systems, so you'll learn how  to gather comprehensive information about system users such as their social accounts, friends, their mails.....etc, you'll learn how to  create trojans by backdooring normal files (such as an image or a pdf) and use the gathered information to spoof emails so they appear as if  they're sent from the target's friend, boss or any email account they're likely to interact with, to social engineer them into running your  trojan.3. Post Exploitation - In this section you will learn how to interact with the systems you compromised so far. You’ll learn how  to access the file system (read/write/upload/execute), maintain your access, spy on the target (capture key strikes, turn on the webcam, take screenshots....etc) and even use the target computer as a pivot to hack other systems.4. Website / Web Application Hacking - In this secti on you will learn how websites work, how to gather information about a target website (such as website owner, server location, used technologies ....etc)     and how to discover and exploit the following dangerous vulnerabilities to hack websites"
    },
    {
        "id": "02",
        "title": "The Ultimate 2022 Fullstack Web Development Bootcamp",
        "category": "Web Development",
        "img": "https://images.pexels.com/photos/11035371/pexels-photo-11035371.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "price": 15000,
        "description": "Welcome to the Ultimate 2022 Web Development Bootcamp, the only course you need to learn to code and become a full-stack web developer and the only course that will prepare you for a career in web development.At 40+ hours, this web development course is extremely comprehensive and one of the most detailed courses available on Udemy! Even if you have zero programming experience, this course will take you from beginner to coding ninja. Here's how",
        "syllabus": "Get a very deep understanding of how to create Angular  applicationsThis course will teach you all the fundamentals about modules,components, databinding, routing, HTTP access and much more! We will  take a lot of deep dives and each section is backed up with a real project. All examples showcase the features Angular offers and how to a pply them correctly.Specifically you will learn:Which architecture Angular usesHow to use TypeScript to write Angular applicationsAll abou t directives and components, including the creation of custom directives/ componentsHow databinding worksAll about routing and handling  navigationWhat Pipes are and how to use themHow to access the Web (e.g. RESTful servers)dependency injection is and how to use itHow to use Modules in AngularHow to optimize your Angular ApplicationAn introduction to NgRx and complex state managementWe will build a  major project in this course so that you can practice all concepts and so much more!ay once, benefit a lifetime "
    },
    {
        "id": "03",
        "title": "Graphic Design Masterclass - Learn GREAT Design",
        "category": "Graphic Design",
        "img": "https://images.pexels.com/photos/3747266/pexels-photo-3747266.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "price": 16750,
        "description": "The Ultimate Graphic Design Course Which Covers Photoshop, Illustrator, InDesign,Design Theory, Branding and Logo Design",
        "syllabus": "As you can see, this course is updated frequently with new lessons, /n projects and resources!August 2022 - NEW Section! /n Learn to Create a Custom Brand Presentation Mockup in Adobe PhotoshopJanuary 2022 -  NEW Section! Design Trends 2022! We will figure out how to predict future design trends and create three projects!November 2021 - NEW Sections! Adobe Photoshop and Illustrator 2022 update lessons and Adobe Illustrator 3D class Project!June 2021 - NEW Lesson! How to properly  give and receiveand !  on how to create YouTube Thumbnails!March 2021 - NEW! Video on How to Encourage and Spark CreativityMarch 2021 - NEW!  Section on The Double Exposure Effect in Adobe  2021!March 2021 - NEW!  Section creating vector art in Adobe Illustrator 2021 using the new repeat tool and the blend tool.February 2021 - NEW!  Detailed section on  Photoshop Photo editing basics -  New projects added!January  2021 - NEW!   2021 Design Trends Section with three new student projects!November 2020 - NEW!  16 page History of Typography Guide, 16 Page Color Theory Guide and 8 Page Font Pairing Guide!October 2020 - Updated Lessons!  Photoshop 2021 Neural Filter and Liquify ToolsAugust 2020 - Updated Lessons!   Logo Design and Branding ProjectJuly 2020 - NEW!  How to work with Photoshop Mockups!June 2020 - NEW!   How to Become a Graphic Designer 14 page   and Lessons!May 2020 - NEW!  InDesign Portfolio Builder Template!April 2020 - NEW!  Entirely new Adobe InDesign Section including a cookbook projectApril 2020 - !  Color  - Exploring Color Palettes SectionMarch 2020 - NEW! A Guide to My Favorite Fonts   and Where to Download ThemJan 2020 - NEW! Lessons: 2020 Design Trends: and how to create  2019 - NEW! - Adobe Illustrator introduction and tools section (vector tracing worksheet)Nov 2019 - NEW! - Photoshop section and Projects (including a new youtube  and book cover project)Oct 2019 - NEW!  11 page downloadable resource  The Guide to GridsOct 2019 - NEW!  Color Theory and Color Harmony Lessons + new Downloadable  2019 - NEW!   Affinity Designer Section! Learn The Basic Tools and Differences Between Adobe Illustrator And Affinity DesignerMay 2019 - NEW! Downloadable Resources -  the  of Typography poster and the Psychology of Color!April 2019 - NEW Lessons: Finding Your Graphic Design  Niche and Focus!Graphic Design Master Class - Learn GREAT Design "
    },
    {
        "id": "04",
        "title": "Data Analytics in Regression",
        "category": "Data Analysis ",
        "img": "https://images.pexels.com/photos/186461/pexels-photo-186461.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "price": 9800,
        "description": "Get marketable and highly sought after skills in this course while substantially increasing your knowledge of data analytics in regression. All course videos created and narrated by an award winning  instructor and textbook author of quantitative methods.",
        "syllabus": " Part 1 - data preprocessingpart  2 - regression: simple linear regression, multiple linear  regression, polynomial regression, svr, decision tree regression, random forest regressionpart  3 - classification: logistic regression, k-nn, svm,  kernel svm, naive bayes, decision tree classification, random forest classificationpart 4"
    },
    {
        "id": "05",
        "title": "Website Hacking / Penetration Testing",
        "category": "Penetration Testing ",
        "img": "https://images.pexels.com/photos/546819/pexels-photo-546819.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "price": 7000,
        "description": "Note: The contents of this course are not covered in any of my other courses except for some basics. Although website hacking is covered in one of my other courses, that course only covers the basics where this course dives much deeper in this topic covering more techniques, more vulnerabilities, advanced exploitation, advanced post exploitation, bypassing security and more!",
        "syllabus":"Get a very deep understanding of how to create Angular applicationsThis course will teach you all the fundamentals about modules,components, databinding, routing, HTTP access and much more!  We will take a lot of deep dives and each section is backed up with a real project. All examples showcase the features Angular offers and  how to apply them correctly.Specifically you will learn:Which architecture Angular usesHow to use TypeScript to write Angular applicationsAll  about directives and components, including the creation of custom directives/ componentsHow databinding worksAll about routing and  handling navigationWhat Pipes are and how to use themHow to access the Web (e.g. RESTful servers)dependency injection is and how to use itHow  to use Modules in AngularHow to optimize your Angular ApplicationAn introduction to NgRx and complex state managementWe will build a major  project in this course so that you can practice all concepts and so much more!ay once, benefit a lifetime "
    },
    {
        "id": "06",
        "title": "The Complete Machine Learning Course with Python",
        "category": "Machine Learning ",
        "img": "https://images.pexels.com/photos/2599244/pexels-photo-2599244.jpeg?auto=compress&cs=tinysrgb&w=1600",
        "price": 17500,
        "description": "The Complete Machine Learning Course in Python has been FULLY UPDATED for November 2019! With brand new sections as well as updated and improved content, you get everything you need to master Machine Learning in one course! The machine learning field is constantly evolving, and we want to make sure students have the most up-to-date information and practices available to them",
        "syllabus": " Part 1 - data preprocessingpart  2 - regression: simple linear regression, multiple linear regression, polynomial regression, svr, decision tree regression, random forest regressionpart  3 - classification: logistic regression, k-nn, svm, kernel svm, naive bayes, decision tree classification, random forest classificationpart  4 - clustering: k-means, hierarchical clusteringpart  5 - association rule learning:, eclatpart  6 - reinforcement learning: upper confidence bound, thompson samplingpart  7 - natural language processing: bag-of-words model and  for nlp  8 - deep learning: artificial neural networks, convolutional neural networkspart 9 - dimensionality reduction: pca, lda, kernel pcapart  0 - model selection & boosting: k-fold cross validation, parameter tuning, grid search, xgboost "
    }
]